@adambarreiro I have this objective: setting some sizing policies but I would like to have the system default policy as the default one.

my code:
```
## org-vdc
resource "vcd_org_vdc" "vdc" {
  count = local.vdc.required == true ? 1 : 0 # only if vdc is required

  . . .
  default_compute_policy_id = local.default_compute_policy_id
  vm_sizing_policy_ids      = length(local.vm_sizing_policy_ids) > 0 ? local.vm_sizing_policy_ids : null
  vm_placement_policy_ids   = try(local.vdc.placement_policy_ids, [])
  . . .
}
```
in my case `local.default_compute_policy_id` is 'null' and `local.vm_sizing_policy_ids` has 4 policies.

plan output:
```
  # vcd_org_vdc.vdc[0] will be created
  + resource "vcd_org_vdc" "vdc" {
      . . .
      + default_compute_policy_id        = (known after apply)
      + default_vm_sizing_policy_id      = (known after apply)
      . . .
      + vm_placement_policy_ids          = (known after apply)
      + vm_sizing_policy_ids             = [
          + "urn:vcloud:vdcComputePolicy:1c1bf120-....-f59e29e8e33c",
          + "urn:vcloud:vdcComputePolicy:4a102293-....-0da7973dbef5",
          + "urn:vcloud:vdcComputePolicy:82c1731b-....-f1237af0dce8",
          + "urn:vcloud:vdcComputePolicy:e3b95405-....-fd0448ad397b",
        ]
      + vm_vgpu_policy_ids               = (known after apply)
```
after apply:
```
$ terraform state show vcd_org_vdc.vdc[0]
# vcd_org_vdc.vdc[0]:
resource "vcd_org_vdc" "vdc" {
    . . .
    default_compute_policy_id        = "urn:vcloud:vdcComputePolicy:cf3a9fad-....-112ec862dc4a"
    default_vm_sizing_policy_id      = "urn:vcloud:vdcComputePolicy:cf3a9fad-....-112ec862dc4a"
    . . .
    vm_placement_policy_ids          = []
    vm_sizing_policy_ids             = [
        "urn:vcloud:vdcComputePolicy:1c1bf120-....-f59e29e8e33c",
        "urn:vcloud:vdcComputePolicy:4a102293-....-0da7973dbef5",
        "urn:vcloud:vdcComputePolicy:82c1731b-....-f1237af0dce8",
        "urn:vcloud:vdcComputePolicy:e3b95405-....-fd0448ad397b",
    ]
    vm_vgpu_policy_ids               = []
```
as you can se the `default_compute_policy_id` (id ending with `dc4a`) is not included in the `vm_sizing_policy_ids`, while on UI I can see the system default policy (there are 5 policies, not just 4)

So this is what I want, but if I apply again I got an error, because of this:

```
  # vcd_org_vdc.vdc[0] will be updated in-place
  ~ resource "vcd_org_vdc" "vdc" {
        . . .
      ~ vm_sizing_policy_ids             = [
          - "urn:vcloud:vdcComputePolicy:cf3a9fad-....-112ec862dc4a",
            # (4 unchanged elements hidden)
        ]
```
this is the error, that I understand.
I cannot set the id of the default policy without a data source, that cannot be done without knowing that is not the first apply.
```
Error: error assigning VM sizing policies to VDC: `default_compute_policy_id` urn:vcloud:vdcComputePolicy:cf3a9fad-....-112ec862dc4a is not present in any of `[vm_sizing_policy_ids vm_placement_policy_ids vm_vgpu_policy_ids]`
```
Is there a way I can solve this on a second apply?